HR_P3/CFD/constant/porousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    porosity
    {
        coordinateSystem
        {
            e1  (1 0 0);
            e2  (0 1 0);
        }

        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (1 1 1);
            f   f [0 -1 0 0 0 0 0] (1 1 1);
        }
    }
)

// ************************************************************************* //
